{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Item", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "Item"}, "inbound_nodes": []}, {"name": "User", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "User"}, "inbound_nodes": []}, {"name": "Movie-Embedding-MLP", "class_name": "Embedding", "config": {"name": "Movie-Embedding-MLP", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1684, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["Item", 0, 0, {}]]]}, {"name": "User-Embedding-MLP", "class_name": "Embedding", "config": {"name": "User-Embedding-MLP", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 945, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["User", 0, 0, {}]]]}, {"name": "FlattenMovies-MLP", "class_name": "Flatten", "config": {"name": "FlattenMovies-MLP", "trainable": true}, "inbound_nodes": [[["Movie-Embedding-MLP", 0, 0, {}]]]}, {"name": "FlattenUsers-MLP", "class_name": "Flatten", "config": {"name": "FlattenUsers-MLP", "trainable": true}, "inbound_nodes": [[["User-Embedding-MLP", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["FlattenMovies-MLP", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["FlattenUsers-MLP", 0, 0, {}]]]}, {"name": "Concat", "class_name": "Merge", "config": {"name": "Concat", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["dropout_1", 0, 0, {"mask": [null, null]}], ["dropout_3", 0, 0, {"mask": [null, null]}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Concat", 0, 0, {}]]]}, {"name": "FullyConnected", "class_name": "Dense", "config": {"name": "FullyConnected", "trainable": true, "units": 200, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "Batch", "class_name": "BatchNormalization", "config": {"name": "Batch", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FullyConnected", 0, 0, {}]]]}, {"name": "Dropout-1", "class_name": "Dropout", "config": {"name": "Dropout-1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Batch", 0, 0, {}]]]}, {"name": "FullyConnected-1", "class_name": "Dense", "config": {"name": "FullyConnected-1", "trainable": true, "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Dropout-1", 0, 0, {}]]]}, {"name": "Batch-2", "class_name": "BatchNormalization", "config": {"name": "Batch-2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FullyConnected-1", 0, 0, {}]]]}, {"name": "Movie-Embedding-MF", "class_name": "Embedding", "config": {"name": "Movie-Embedding-MF", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1684, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["Item", 0, 0, {}]]]}, {"name": "User-Embedding-MF", "class_name": "Embedding", "config": {"name": "User-Embedding-MF", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 945, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["User", 0, 0, {}]]]}, {"name": "Dropout-2", "class_name": "Dropout", "config": {"name": "Dropout-2", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Batch-2", 0, 0, {}]]]}, {"name": "FlattenMovies-MF", "class_name": "Flatten", "config": {"name": "FlattenMovies-MF", "trainable": true}, "inbound_nodes": [[["Movie-Embedding-MF", 0, 0, {}]]]}, {"name": "FlattenUsers-MF", "class_name": "Flatten", "config": {"name": "FlattenUsers-MF", "trainable": true}, "inbound_nodes": [[["User-Embedding-MF", 0, 0, {}]]]}, {"name": "FullyConnected-2", "class_name": "Dense", "config": {"name": "FullyConnected-2", "trainable": true, "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Dropout-2", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["FlattenMovies-MF", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["FlattenUsers-MF", 0, 0, {}]]]}, {"name": "FullyConnected-3", "class_name": "Dense", "config": {"name": "FullyConnected-3", "trainable": true, "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["FullyConnected-2", 0, 0, {}]]]}, {"name": "Dot", "class_name": "Merge", "config": {"name": "Dot", "mode": "dot", "mode_type": "raw", "concat_axis": -1, "dot_axes": [1, 1], "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["dropout_2", 0, 0, {"mask": [null, null]}], ["dropout_4", 0, 0, {"mask": [null, null]}]]]}, {"name": "Activation", "class_name": "Dense", "config": {"name": "Activation", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["FullyConnected-3", 0, 0, {}]]]}, {"name": "Concat-MF-MLP", "class_name": "Merge", "config": {"name": "Concat-MF-MLP", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["Dot", 0, 0, {"mask": [null, null]}], ["Activation", 0, 0, {"mask": [null, null]}]]]}, {"name": "Combine-MF-MLP", "class_name": "Dense", "config": {"name": "Combine-MF-MLP", "trainable": true, "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Concat-MF-MLP", 0, 0, {}]]]}, {"name": "FullyConnected-4", "class_name": "Dense", "config": {"name": "FullyConnected-4", "trainable": true, "units": 50, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Combine-MF-MLP", 0, 0, {}]]]}, {"name": "Prediction", "class_name": "Dense", "config": {"name": "Prediction", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["FullyConnected-4", 0, 0, {}]]]}], "input_layers": [["User", 0, 0], ["Item", 0, 0]], "output_layers": [["Prediction", 0, 0]]}, "keras_version": "2.1.3", "backend": "tensorflow"}